W9D3/ninety_nine_cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "2010-01-28"], ["description", "A very old cat..."], ["updated_at", "2019-10-02 23:24:21.272070"], ["id", 15]]