W9D5/music_app/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "GqKRHMWj_Lm1BFcn9gaE8Q"], ["LIMIT", 1]]
---
    def current_user
        return nil if session[:session_token].nil?

        # fail
        @current_user ||= User.find_by(session_token: session[:session_token])