W9D5/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "alex3@alex3.com"], ["password_digest", "$2a$12$lpl8OpbJB5Q66iPtHxP5RuoKHgd4dG89FTqFrt8kXnA8ZJXWlR0ly"], ["session_token", "I8eLbMNRDmz2kIYEZSNMhA"]]
---
    def create
        @user = User.new(user_params)
        # @user.password = params[:password]

        if @user.save